Repository: c43892/mytube
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, hi, it, ja, ko, pt, ru, zh, zh_hant

# appTitle
source: YouTube Video List
ar: قائمة فيديوهات YouTube
de: YouTube-Videoliste
es: Lista de videos de YouTube
hi: YouTube वीडियो सूची
it: Elenco video YouTube
ja: YouTube動画リスト
ko: YouTube 동영상 목록
pt: Lista de vídeos do YouTube
ru: Список видео YouTube
zh: YouTube 视频列表
zh_hant: YouTube 影片列表

# searchHint
source: Search videos (Shorts filtered)
ar: ابحث عن فيديوهات (تمت تصفية Shorts)
de: Videos suchen (Shorts gefiltert)
es: Buscar videos (Shorts filtrados)
hi: वीडियो खोजें (Shorts फ़िल्टर किए गए)
it: Cerca video (Shorts filtrati)
ja: 動画を検索（Shortsは除外）
ko: 동영상 검색 (Shorts 필터링)
pt: Pesquisar vídeos (Shorts filtrados)
ru: Поиск видео (Shorts отфильтрованы)
zh: 搜索视频（已过滤 Shorts）
zh_hant: 搜尋影片（已過濾 Shorts）

source: Search
ar: بحث
de: Suchen
es: Buscar
hi: खोजें
it: Cerca
ja: 検索
ko: 검색
pt: Pesquisar
ru: Поиск
zh: 搜索
zh_hant: 搜尋

source: Loading...
ar: جارٍ التحميل...
de: LÃ¤dt...
es: Cargando...
hi: लोड हो रहा है...
it: Caricamento...
ja: 読み込み中...
ko: 로딩 중...
pt: Carregando...
ru: Загрузка...
zh: 加载中...
zh_hant: 載入中...

source: Downloading: {progress}%
ar: جارٍ التنزيل: {progress}%
de: Herunterladen: {progress}%
es: Descargando: {progress}%
hi: डाउनलोड हो रहा है: {progress}%
it: Download: {progress}%
ja: ダウンロード中: {progress}%
ko: 다운로드 중: {progress}%
pt: Baixando: {progress}%
ru: Скачивание: {progress}%
zh: 下载中：{progress}%
zh_hant: 下載中：{progress}%

# loadHomeFailed
source: Failed to load home videos: {error}
ar: فشل تحميل فيديوهات الصفحة الرئيسية: {error}
de: Startvideos konnten nicht geladen werden: {error}
es: Error al cargar videos de inicio: {error}
hi: होम वीडियो लोड नहीं हुए: {error}
it: Caricamento video home non riuscito: {error}
ja: ホーム動画の読み込みに失敗: {error}
ko: 홈 영상 로드 실패: {error}
pt: Falha ao carregar vídeos iniciais: {error}
ru: Не удалось загрузить главные видео: {error}
zh: 加载首页视频失败：{error}
zh_hant: 載入首頁影片失敗：{error}

# searchFailed
source: Search failed: {error}
ar: فشل البحث: {error}
de: Suche fehlgeschlagen: {error}
es: Error de búsqueda: {error}
hi: खोज विफल: {error}
it: Ricerca non riuscita: {error}
ja: 検索に失敗: {error}
ko: 검색 실패: {error}
pt: Falha na pesquisa: {error}
ru: Ошибка поиска: {error}
zh: 搜索失败：{error}
zh_hant: 搜尋失敗：{error}

# downloadInitFailed
source: Download init failed: {error}
ar: فشل تهيئة التنزيل: {error}
de: Download-Initialisierung fehlgeschlagen: {error}
es: Error al iniciar descarga: {error}
hi: डाउनलोड शुरू करने में विफल: {error}
it: Inizializzazione download non riuscita: {error}
ja: ダウンロード初期化に失敗: {error}
ko: 다운로드 초기화 실패: {error}
pt: Falha ao iniciar download: {error}
ru: Ошибка инициализации загрузки: {error}
zh: 下载初始化失败：{error}
zh_hant: 下載初始化失敗：{error}

# downloadFailed
source: Download failed: {error}
ar: فشل التنزيل: {error}
de: Download fehlgeschlagen: {error}
es: Descarga fallida: {error}
hi: डाउनलोड विफल: {error}
it: Download non riuscito: {error}
ja: ダウンロード失敗: {error}
ko: 다운로드 실패: {error}
pt: Falha no download: {error}
ru: Ошибка загрузки: {error}
zh: 下载失败：{error}
zh_hant: 下載失敗：{error}

# downloadTaskFailed
source: Download failed/cancelled, please retry
ar: فشل/أُلغي التنزيل، حاول مرة أخرى
de: Download fehlgeschlagen/abgebrochen, bitte erneut versuchen
es: Descarga fallida/cancelada, inténtalo de nuevo
hi: डाउनलोड विफल/रद्द, कृपया फिर से प्रयास करें
it: Download fallito/annullato, riprova
ja: ダウンロード失敗/キャンセル。再試行してください
ko: 다운로드 실패/취소됨, 다시 시도하세요
pt: Download falhou/cancelado, tente novamente
ru: Загрузка не удалась/отменена, повторите попытку
zh: 下载失败/已取消，请重试
zh_hant: 下載失敗/已取消，請重試

source: Video
ar: فيديو
hi: वीडियो
ja: 動画
ko: 동영상
pt: Vídeo
ru: Видео
zh: 视频
zh_hant: 影片

# duration
source: Duration {value}
ar: المدة {value}
de: Dauer {value}
es: Duración {value}
hi: अवधि {value}
it: Durata {value}
ja: 長さ {value}
ko: 길이 {value}
pt: Duração {value}
ru: Длительность {value}
zh: 时长 {value}
zh_hant: 時長 {value}

source: Unknown Channel
ar: قناة غير معروفة
de: Unbekannter Kanal
es: Canal desconocido
hi: अज्ञात चैनल
it: Canale sconosciuto
ja: 不明なチャンネル
ko: 알 수 없는 채널
pt: Canal desconhecido
ru: Неизвестный канал
zh: 未知频道
zh_hant: 未知頻道
